{"keras_version": "1.2.0", "class_name": "Sequential", "config": [{"class_name": "Convolution2D", "config": {"name": "convolution2d_1", "W_constraint": null, "init": "glorot_uniform", "batch_input_shape": [null, 80, 160, 3], "trainable": true, "b_constraint": null, "subsample": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "nb_row": 5, "b_regularizer": null, "activation": "relu", "bias": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 24, "input_dtype": "float32", "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_2", "W_constraint": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "subsample": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "nb_row": 5, "b_regularizer": null, "activation": "relu", "bias": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 36, "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_3", "W_constraint": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "subsample": [2, 2], "dim_ordering": "tf", "border_mode": "valid", "nb_row": 5, "b_regularizer": null, "activation": "relu", "bias": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 48, "nb_col": 5}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_4", "W_constraint": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "subsample": [1, 1], "dim_ordering": "tf", "border_mode": "valid", "nb_row": 3, "b_regularizer": null, "activation": "relu", "bias": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 64, "nb_col": 3}}, {"class_name": "Convolution2D", "config": {"name": "convolution2d_5", "W_constraint": null, "init": "glorot_uniform", "trainable": true, "b_constraint": null, "subsample": [1, 1], "dim_ordering": "tf", "border_mode": "valid", "nb_row": 3, "b_regularizer": null, "activation": "relu", "bias": true, "activity_regularizer": null, "W_regularizer": null, "nb_filter": 64, "nb_col": 3}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dense", "config": {"name": "dense_1", "W_constraint": null, "init": "glorot_uniform", "trainable": true, "output_dim": 1164, "b_constraint": null, "activity_regularizer": null, "activation": "relu", "input_dim": 2496, "b_regularizer": null, "W_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"name": "dense_2", "W_constraint": null, "init": "glorot_uniform", "trainable": true, "output_dim": 100, "b_constraint": null, "activity_regularizer": null, "activation": "relu", "input_dim": 1164, "b_regularizer": null, "W_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"name": "dense_3", "W_constraint": null, "init": "glorot_uniform", "trainable": true, "output_dim": 50, "b_constraint": null, "activity_regularizer": null, "activation": "relu", "input_dim": 100, "b_regularizer": null, "W_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"name": "dense_4", "W_constraint": null, "init": "glorot_uniform", "trainable": true, "output_dim": 10, "b_constraint": null, "activity_regularizer": null, "activation": "relu", "input_dim": 50, "b_regularizer": null, "W_regularizer": null, "bias": true}}, {"class_name": "Dense", "config": {"name": "dense_5", "W_constraint": null, "init": "glorot_uniform", "trainable": true, "output_dim": 1, "b_constraint": null, "activity_regularizer": null, "activation": "tanh", "input_dim": 10, "b_regularizer": null, "W_regularizer": null, "bias": true}}]}